УчетВУправляющихДляГит1/src/Enums/ЭлементыЗатрат/ЭлементыЗатрат.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ЭлементыЗатрат</name>
  <enumValues>
    <name>МатериальныеЗатраты</name>
    <comment>Строка 5610</comment>
  </enumValues>
  <enumValues>
    <name>ОплатаТруда</name>
    <comment>Строка 5620</comment>
  </enumValues>
  <enumValues>
    <name>ОтчисленияНаСоциальныеНужды</name>
    <comment>Строка 5630</comment>
  </enumValues>
  <enumValues>
    <name>Амортизация</name>
    <comment>Строка 5640</comment>
  </enumValues>
  <enumValues>
    <name>ПрочиеЗатраты</name>
    <comment>Строка 5650</comment>
  </enumValues>
</mdclass:Enum>

УчетВУправляющихДляГит1/src/Enums/ЭлементыЗатрат/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Функция КорСчета() Экспорт
	
	КорСчета = Новый ТаблицаЗначений;
	КорСчета.Колонки.Добавить("Элемент", Новый ОписаниеТипов("ПеречислениеСсылка.ЭлементыЗатрат"));
	КорСчета.Колонки.Добавить("КорСчет", Новый ОписаниеТипов("ПланСчетовСсылка.Хозрасчетный"));
	
	// Материалы
	// 10, 21, 41, 43, 45
	ДобавитьСубсчета(КорСчета, МатериальныеЗатраты, ПланыСчетов.Хозрасчетный.Материалы);
	ДобавитьСубсчета(КорСчета, МатериальныеЗатраты, ПланыСчетов.Хозрасчетный.Полуфабрикаты);
	ДобавитьСубсчета(КорСчета, МатериальныеЗатраты, ПланыСчетов.Хозрасчетный.Товары);
	ДобавитьСубсчета(КорСчета, МатериальныеЗатраты, ПланыСчетов.Хозрасчетный.ГотоваяПродукция);
	ДобавитьСубсчета(КорСчета, МатериальныеЗатраты, ПланыСчетов.Хозрасчетный.ТоварыОтгруженные);
	
	// Оплата труда
	ДобавитьСубсчета(КорСчета, ОплатаТруда, ПланыСчетов.Хозрасчетный.РасчетыСПерсоналомПоОплатеТруда);
	ДобавитьСубсчета(КорСчета, ОплатаТруда, ПланыСчетов.Хозрасчетный.ОценочныеОбязательстваПоВознаграждениям);
	
	// Социальные налоги
	ДобавитьСубсчета(КорСчета, ОтчисленияНаСоциальныеНужды, ПланыСчетов.Хозрасчетный.РасчетыПоСоциальномуСтрахованию);
	ДобавитьСубсчета(КорСчета, ОтчисленияНаСоциальныеНужды, ПланыСчетов.Хозрасчетный.ОценочныеОбязательстваПостраховымВзносам);
	
	// Амортизация
	ДобавитьСубсчета(КорСчета, Амортизация, ПланыСчетов.Хозрасчетный.АмортизацияОсновныхСредств);
	ДобавитьСубсчета(КорСчета, Амортизация, ПланыСчетов.Хозрасчетный.НематериальныеАктивы);
	ДобавитьСубсчета(КорСчета, Амортизация, ПланыСчетов.Хозрасчетный.АмортизацияНематериальныхАктивов);
	
	Возврат КорСчета;
	
КонецФункции

Процедура ДобавитьСубсчета(КорСчета, Элемент, Счет)
	
	Для Каждого Субсчет Из БухгалтерскийУчетПовтИсп.СчетаВИерархии(Счет) Цикл
		НоваяСтрока = КорСчета.Добавить();
		НоваяСтрока.Элемент = Элемент;
		НоваяСтрока.КорСчет = Субсчет;
	КонецЦикла;
	
КонецПроцедуры

#КонецЕсли
